## Reading and writing CSV files with NumPy

In [1]:
# import genfromtxt function
from numpy import genfromtxt

# Read comma separated file
product_data = genfromtxt('demo.csv', delimiter=',')

# display initial 5 records
print(product_data)

[[14. 32. 33.]
 [24. 45. 26.]
 [27. 38. 39.]]

In [2]:
# import numpy
import numpy as np

# Create a sample array
sample_array = np.asarray([ [1,2,3], [4,5,6], [7,8,9] ])

# Write sample array to CSV file
np.savetxt("my_first_demo.csv", sample_array, delimiter=",")

## Reading and writing CSV files with Pandas

In [3]:
# import pandas
import pandas as pd

# Read CSV file
sample_df=pd.read_csv('demo.csv', sep=',' , header=None)

# display initial 5 records
sample_df.head()

    0   1   2
0  14  32  33
1  24  45  26
2  27  38  39

In [4]:
# Save DataFrame to CSV file
sample_df.to_csv('demo_sample_df.csv')

## Reading and Writing Data from Excel

In [5]:
# Read excel file
df=pd.read_excel('employee.xlsx',sheet_name='performance')

# display initial 5 records
df.head()

            name  performance_score
0    Allen Smith                723
1        S Kumar                520
2    Jack Morgan                674
3      Ying Chin                556
4  Dheeraj Patel                711

In [6]:
df.to_excel('employee_performance.xlsx')

In [7]:
# Read excel file
emp_df=pd.read_excel('employee.xlsx',sheet_name='employee_details')

In [8]:
# write multiple dataframes to single excel file
with pd.ExcelWriter('new_employee_details.xlsx') as writer:
    emp_df.to_excel(writer, sheet_name='employee')
    df.to_excel(writer, sheet_name='perfromance')

## Reading and Writing Data from JSON

In [9]:
# Reading JSON file
df=pd.read_json('employee.json')

# display initial 5 records
df.head()

            name   age   income gender  department grade
0    Allen Smith  45.0      NaN   None  Operations    G3
1        S Kumar   NaN  16000.0      F     Finance    G0
2    Jack Morgan  32.0  35000.0      M     Finance    G2
3      Ying Chin  45.0  65000.0      F       Sales    G3
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2

In [10]:
# Writing DataFrame to JSON file
df.to_json('employee_demo.json',orient="columns")

## Reading and Writing Data from HDF5

In [11]:
# Write DataFrame to hdf5
df.to_hdf('employee.h5', 'table', append=True)

In [12]:
# Read a hdf5 file
df=pd.read_hdf('employee.h5', 'table')

# display initial 5 records
df.head()

            name   age   income gender  department grade
0    Allen Smith  45.0      NaN    NaN  Operations    G3
1        S Kumar   NaN  16000.0      F     Finance    G0
2    Jack Morgan  32.0  35000.0      M     Finance    G2
3      Ying Chin  45.0  65000.0      F       Sales    G3
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2

## Reading and Writing Data from HTML Tables

In [13]:
import pandas as pd

In [14]:
# Reading HTML table from given URL
table_url = 'https://en.wikipedia.org/wiki/List_of_sovereign_states_and_dependent_territories_in_North_America'
df_list = pd.read_html(table_url)
print("Number of DataFrames:",len(df_list))

Number of DataFrames: 8

In [15]:
# Check first DataFrame
print(df_list[0].head())

   Flag        English Short Name            English Long Name  \
0   NaN  Antigua and Barbuda[n 1]          Antigua and Barbuda
1   NaN         Bahamas, The[n 1]  Commonwealth of The Bahamas
2   NaN             Barbados[n 1]                     Barbados
3   NaN          Belize[n 1][n 2]                       Belize
4   NaN               Canada[n 3]                       Canada

          Domestic Short Name(s)     Capital               Currency
0   English: Antigua and Barbuda  St. John's  East Caribbean dollar
1               English: Bahamas      Nassau        Bahamian dollar
2              English: Barbados  Bridgetown       Barbadian dollar
3                English: Belize    Belmopan          Belize dollar
4  English: CanadaFrench: Canada      Ottawa        Canadian dollar

In [16]:
# Write DataFrame to raw HTML
df_list[1].to_html('country.html')

## Reading and Writing Data from parquet

In [17]:
!pip install pyarrow

Requirement already satisfied: pyarrow in /home/avinash/anaconda3/lib/python3.8/site-packages (2.0.0)
Requirement already satisfied: numpy>=1.14 in /home/avinash/anaconda3/lib/python3.8/site-packages (from pyarrow) (1.18.5)

In [18]:
# Write to a parquet file.
df.to_parquet('employee.parquet', engine='pyarrow')

In [19]:
# Read parquet file
employee_df = pd.read_parquet('employee.parquet', engine='pyarrow')

# display initial 5 records
employee_df.head()

            name   age   income gender  department grade
0    Allen Smith  45.0      NaN   None  Operations    G3
1        S Kumar   NaN  16000.0      F     Finance    G0
2    Jack Morgan  32.0  35000.0      M     Finance    G2
3      Ying Chin  45.0  65000.0      F       Sales    G3
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2

## Reading and Writing Data from Pickle Pandas Object

In [20]:
# import pandas
import pandas as pd

# Read CSV file
df=pd.read_csv('demo.csv', sep=',' , header=None)

# Save DataFrame object in pickle file
df.to_pickle('demo_obj.pkl')

In [21]:
#Read DataFrame object from pickle file
pickle_obj=pd.read_pickle('demo_obj.pkl')

# display initial 5 records
pickle_obj.head()

    0   1   2
0  14  32  33
1  24  45  26
2  27  38  39

## Lightweight access with sqllite3

In [23]:
# Import sqlite3
import sqlite3

# Create connection. This will create the connection with employee database. If the database does not exist it will create the database
conn = sqlite3.connect('employee.db')

# Create cursor
cur = conn.cursor()

# Execute SQL query and create the database table
cur.execute("create table emp(eid int,salary int)")

# Execute SQL query and Write the data into database
cur.execute("insert into emp values(105, 57000)")

# commit the transaction
conn.commit()

# Execute SQL query and Read the data from the database
cur.execute('select * from emp')

# Fetch records
print(cur.fetchall())

# Close the Database connection
conn.close()

[(105, 57000)]

## Reading and Writing Data from MySQL

In [ ]:
# import pymysql connector module
import pymysql

# Create a connection object using connect() method 

connection = pymysql.connect(host='localhost', # IP address of the MySQL database server
                             user='root', # user name
                             password='root', # password
                             db='emp', # database name
                             charset='utf8mb4', # character set
                             cursorclass=pymysql.cursors.DictCursor) # cursor type

try:
    with connection.cursor() as cur:
        # Inject a record in database
        sql_query = "INSERT INTO `emp` (`eid`, `salary`) VALUES (%s, %s)"
        cur.execute(sql_query, (104,43000))


    # Commit the record insertion explicitly.
    connection.commit()

    with connection.cursor() as cur:
        # Read records from employee table
        sql_query = "SELECT * FROM `emp`"
        cur.execute(sql_query )
        table_data = cur.fetchall()
        print(table_data)
except:
    print("Exception Occurred")
finally:
    connection.close()

In [ ]:
# Import the required connector
import mysql.connector
import pandas as pd

# Establish a database connection to mysql
connection=mysql.connector.connect(user='root',password='root',host='localhost',database='emp')

# Create a cursor
cur=connection.cursor()

# Running sql query
cur.execute("select * from emp")

# Fetch all the records and print it one by one
records=cur.fetchall()
for i in records:
    print(i)

# Create a DataFrame from fetched records.
df = pd.DataFrame(records)

# Assign column names to DataFrame
df.columns = [i[0] for i in cur.description]

# close the connection
connection.close()

In [ ]:
# Import the sqlalchemy engine
from sqlalchemy import create_engine

# Instantiate engine object
en = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                .format(user="root", pw="root", 
                        db="emp"))

# Insert the whole dataframe into the database
df.to_sql('emp', con=en, if_exists='append',chunksize=1000, index= False)

## Reading and Writing Data from MongoDB

In [27]:
!pip install pymongo

Collecting pymongo
  Downloading pymongo-3.11.2-cp38-cp38-manylinux2014_x86_64.whl (531 kB)
     |████████████████████████████████| 531 kB 1.7 MB/s eta 0:00:01
Installing collected packages: pymongo
Successfully installed pymongo-3.11.2

In [41]:
# Import pymongo
import pymongo

# Create mongo client
client = pymongo.MongoClient()

# Get database
db = client.employee

# Get the collection from database
collection = db.emp

# Write the data using insert_one() method
employee_salary = {"eid":114, "salary":25000}
collection.insert_one(employee_salary)

# Create a dataframe with fetched data
data = pd.DataFrame(list(collection.find()))

In [42]:
data.head()

                        _id  eid  salary
0  5ff454ca3fdcce328b7f8fdb  114   25000

## Reading and Writing Data from Cassandra

In [27]:
!pip install cassandra-driver

Requirement already satisfied: cassandra-driver in /home/avinash/anaconda3/lib/python3.8/site-packages (3.24.0)
Requirement already satisfied: geomet<0.3,>=0.1 in /home/avinash/anaconda3/lib/python3.8/site-packages (from cassandra-driver) (0.2.1.post1)
Requirement already satisfied: six>=1.9 in /home/avinash/anaconda3/lib/python3.8/site-packages (from cassandra-driver) (1.15.0)
Requirement already satisfied: click in /home/avinash/anaconda3/lib/python3.8/site-packages (from geomet<0.3,>=0.1->cassandra-driver) (7.1.2)

In [38]:
# Import the cluster
from cassandra.cluster import Cluster

# Creating a cluster object
cluster = Cluster()

# Create connections by calling Cluster.connect():
conn = cluster.connect()

# Execute the insert query
conn.execute("""INSERT INTO employee.emp_details (eid, ename, age) VALUES (%(eid)s, %(ename)s, %(age)s)""", {'eid':101, 'ename': "Steve Smith", 'age': 42})

# Execute the select query
rows = conn.execute('SELECT * FROM employee.emp_details')

# Print the results
for emp_row in rows:
    print(emp_row.eid, emp_row.ename, emp_row.age)

# Create a dataframe with fetched data
data = pd.DataFrame(rows)

101 Steve Smith 42

## Reading and Writing Data from Redis

In [40]:
!pip install redis

Requirement already satisfied: redis in /home/avinash/anaconda3/lib/python3.8/site-packages (3.5.3)

In [39]:
# Import module
import redis

# Create connection
r = redis.Redis(host='localhost', port=6379, db=0)

# Setting key-value pair
r.set('eid', '101')

# Get value for given key
value=r.get('eid')

# Print the value
print(value)

b'101'

## Pony ORM

In [ ]:
!pip install pony

In [ ]:
# Import pony module
from pony.orm import *

# Create database
db = Database()

# Define entities
class Emp(db.Entity):
    eid = PrimaryKey(int,auto=True)
    salary = Required(int)

# Check entity definition
show(Emp)

# Bind entities to MySQL database
db.bind('mysql', host='localhost', user='root', passwd='root', db='emp')

# Generate required mappings for entities
db.generate_mapping(create_tables=True)

# turn on the debug mode
sql_debug(True)

# Select the records from Emp entities or emp table
select(e for e in Emp)[:]

# Show the values of all the attribute
select(e for e in Emp)[:].show()